# GetNumberOfConditions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingConditions..::..GetNumberOfConditions Method
RoutingConditions Class See Also
---
Gets the number of included routing conditions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetNumberOfConditions()
```

Visual Basic
---
```text
Public Function GetNumberOfConditions As Integer
```

Visual C++
---
```text
public:
int GetNumberOfConditions()
```

# See Also
RoutingConditions Class
Autodesk.Revit.DB Namespace